In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'k1' : ['one'] * 3 + ['two'] * 4,
        'k2' : [1,1,2,3,3,4,4]
    }
)
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [3]:
# 중복값 확인 - 그전값과 중복일때 true
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [4]:
# 중복값 제거 함수 - 실제 데이터가 지워지진 않는다.!
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [5]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [6]:
# 새로운 열 추가
df['v1'] = np.arange(7)

In [7]:
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [8]:
df.drop_duplicates() # 중복값이 하나도 없어진다. 행의 모든 값이 같아야 중복으로 인정

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [10]:
# 특정열의 값들로 중복값 제거 - () 안에 특정열 지정
df.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
3  two   3   3

In [11]:
df.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [ ]:
# 중복되었을 때 뒤에 나온 것을 남기고 싶다.!
df.drop_duplicates(['k1','k2'],keep = 'last')

In [12]:
# Data값 변형
s = pd.Series(
    [1,-999,2,-999,-1000,3]
)
s

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [13]:
# 특정값 변경!!!!!!!!!!! 진짜 많이 쓴다.
s2 = s.replace(-999,np.nan)

In [14]:
s2

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
s2.replace(np.nan,0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       3.0
dtype: float64

In [1]:
strA = 'i have a dream. </br> I love you'

In [3]:
strA.replace('</br>','')
strA # 값이 메모리에서 변한것은 아니다.

'i have a dream.  I love you'

In [4]:
strB = strA.split()
strB

['i', 'have', 'a', 'dream.', '</br>', 'I', 'love', 'you']

In [5]:
strC = strA.split('</br>')
strC

['i have a dream. ', ' I love you']

In [23]:
strC = []
for i in strB:
    if i =='</br>':
        continue
    strC.append(i)
    
strC

['i', 'have', 'a', 'dream.', 'I', 'love', 'you']

In [24]:
# Category
df3 = pd.DataFrame(
    {
        'id' : [1,2,3,4,5,6],
        'raw_grade' : ['a','b','b','a','a','e']
    }
)
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [25]:
# category 형으로 변환하기
df3['grade'] = df3['raw_grade'].astype('category')
df3

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [26]:
df3['raw_grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: raw_grade, dtype: object

In [28]:
# data type 이 categry로 변경됨.
df3['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [29]:
# 데이터를 간단하게 변경시킬 수 있다.
df3['grade'].cat.categories = ['very good','good','very bad']
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad